**Muhammad Faris Akbar**
<br></br>
**Fundamental Deep Learning - Sentimen Analisis Shopee**

In [3]:
import sys
import os

try:
    # Jika dijalankan sebagai file .py
    base_path = os.path.dirname(os.path.abspath(__file__))
except NameError:
    # Jika dijalankan di Jupyter/Interactive
    base_path = os.getcwd()

parent_dir = os.path.abspath(os.path.join(base_path, '..'))
sys.path.append(parent_dir)

print("Base Path:", base_path)
print("Parent Directory:", parent_dir)

Base Path: e:\Github\Dicoding-Submission-FDL\Analisis Sentimen
Parent Directory: e:\Github\Dicoding-Submission-FDL

In [5]:
from google_play_scraper import reviews, Sort
import pandas as pd
from Helper import *
from transformers import pipeline
from tqdm import tqdm

e:\Github\Dicoding-Submission-FDL\.venv\Lib\site-packages\tqdm\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html
  from .autonotebook import tqdm as notebook_tqdm
PyTorch was not found. Models won't be available and only tokenizers, configuration and file/data utilities can be used.
PyTorch was not found. Models won't be available and only tokenizers, configuration and file/data utilities can be used.

**Function Scraping Data Google Play**

In [ ]:
def scrape_google_play(app_id, total_count, country='id', lang='id'):
    """
    Fungsi untuk melakukan scraping ulasan dari Google Play Store.
    
    app_id (str): ID aplikasi di Play Store (contoh: 'com.shopee.id')
    total_count (int): Target jumlah data yang ingin diambil
    country (str): Kode negara (default Indonesia 'id')
    lang (str): Bahasa ulasan (default Indonesia 'id')
    """
    print(f"Proses scraping untuk aplikasi: {app_id}...")
    
    result, continuation_token = reviews(
        app_id,
        lang=lang, 
        country=country,
        sort=Sort.NEWEST, # Sort.NEWEST digunakan untuk mendapat data terbaru
        count=total_count, 
        filter_score_with=None # Mengambil semua rating (1-5)
    )

    print(f"Berhasil mengambil {len(result)} data mentah.")
    
    # Konversi hasil scraping ke dalam DataFrame (Tabel)
    df = pd.DataFrame(result)
    
    return df

def label_with_indobert(df):
    pretrained_name = "w11wo/indonesian-roberta-base-sentiment-classifier"
    
    nlp = pipeline(
        "sentiment-analysis", 
        model=pretrained_name, 
        tokenizer=pretrained_name,
        truncation=True, # Potong teks jika terlalu panjang (>512 kata)
        max_length=512
    )
   
    labels = []
    scores = []
    
    for text in tqdm(df['content']):
        try:
            # Prediksi sentimen
            result = nlp(text)[0] 
            
            # Mapping hasil model ke format yang kita inginkan (Kapitalisasi awal)
            label = result['label'] # output: 'positive', 'neutral', 'negative'
            
            # Opsional: Mapping ulang jika ingin format Bahasa Indonesia
            label_map = {
                'positive': 'Positif',
                'neutral': 'Netral',
                'negative': 'Negatif'
            }
            labels.append(label_map.get(label, label))
            scores.append(result['score'])
            
        except Exception as e:
            # Jika ada error pada teks tertentu (jarang terjadi)
            print(f"Error pada teks: {text[:20]}... | {e}")
            labels.append("Netral") # Default fallback
            scores.append(0.0)

    # Masukkan hasil ke DataFrame
    df['sentiment_label'] = labels
    df['confidence_score'] = scores
    
    return df

# def labeling_data(df):
#     """
#     Fungsi untuk memberikan label otomatis berdasarkan skor bintang.
#     Menggunakan logika:
#     1-2 Bintang = Negatif
#     3 Bintang   = Netral
#     4-5 Bintang = Positif
#     """
#     def get_sentiment(score):
#         if score <= 2:
#             return 'Negatif'
#         elif score == 3:
#             return 'Netral'
#         else:
#             return 'Positif'

#     # Terapkan fungsi get_sentiment ke kolom 'score'
#     df['label'] = df['score'].apply(get_sentiment)
    
#     return df

**Main Section**

In [45]:
TARGET_APP = 'com.shopee.id' 
JUMLAH_DATA = 50000          

df_ulasan = scrape_google_play(TARGET_APP, JUMLAH_DATA)

Proses scraping untuk aplikasi: com.shopee.id...
Berhasil mengambil 50000 data mentah.

In [46]:
df_ulasan.head(5)

,reviewId,userName,userImage,content,score,thumbsUpCount,reviewCreatedVersion,at,replyContent,repliedAt,appVersion
0,fded2b8e-a989-49ef-908e-892b881bdaab,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,kesel banget sering masuk tiba tiba ke shoope ...,2,0,NaN,2026-01-27 17:00:19,"Hi kak Rusmini Junita, mohon maaf ya kak atas ...",2026-01-27 18:27:11,NaN
1,4a865d42-843a-41aa-a102-9ddc405587f2,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,kenapa pesanan. cod tidak bisa padahal sudah 2...,2,0,3.67.24,2026-01-27 16:58:58,"Hai Kak eko gaming, maaf Kakak jadi ngga nyama...",2026-01-27 17:25:12,3.67.24
2,3d521416-e8c4-4798-ac7e-f9fc293f45cb,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,Ini kenpa ya gk bisa di instal,2,0,NaN,2026-01-27 16:54:06,"Hai kak Abdul Kholik, mohon maaf atas ketidakn...",2026-01-27 17:24:06,NaN
3,28fc4a34-91b8-43c7-a8c4-c4ff60a49cf3,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,titik pengantaran suka berubah sendiri malah b...,2,0,3.66.27,2026-01-27 16:25:56,"Hai kak, maaf ya untuk kendala yang kaka alami...",2026-01-27 17:25:28,3.66.27
4,342abb28-a83e-4aab-930c-06877c7db5a3,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,TOLONG! kalau aku lagi baca Wattpad tuh jangan...,2,0,3.62.40,2026-01-27 14:41:26,"Hai kak Khofifah Nur, mohon maaf atas ketidakn...",2026-01-27 15:17:36,3.62.40

In [47]:
df_ulasan.info()

<class 'pandas.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 11 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   reviewId              50000 non-null  str
 1   userName              50000 non-null  str
 2   userImage             50000 non-null  str
 3   content               50000 non-null  str
 4   score                 50000 non-null  int64
 5   thumbsUpCount         50000 non-null  int64
 6   reviewCreatedVersion  38189 non-null  str
 7   at                    50000 non-null  datetime64[us]
 8   replyContent          38969 non-null  str
 9   repliedAt             38969 non-null  datetime64[us]
 10  appVersion            38189 non-null  str
dtypes: datetime64[us](2), int64(2), str(7)
memory usage: 4.2 MB

In [48]:
df_ulasan.describe(include='all')

,reviewId,userName,userImage,content,score,thumbsUpCount,reviewCreatedVersion,at,replyContent,repliedAt,appVersion
count,50000,50000,50000,50000,50000.0,50000.000000,38189,50000,38969,38969,38189
unique,50000,500,501,47779,NaN,NaN,448,NaN,29209,NaN,448
top,fded2b8e-a989-49ef-908e-892b881bdaab,Pengguna Google,https://play-lh.googleusercontent.com/EGemoI2N...,Bagus,NaN,NaN,2.95.52,NaN,"hai kak, mohon maaf atas kendala yang kamu ala...",NaN,2.95.52
freq,1,49500,49500,166,NaN,NaN,4232,NaN,107,NaN,4232
mean,NaN,NaN,NaN,NaN,2.0,3.683100,NaN,2024-03-31 23:10:58.940819,NaN,2024-04-13 04:42:16.605609,NaN
min,NaN,NaN,NaN,NaN,2.0,0.000000,NaN,2022-12-24 01:17:50,NaN,2016-02-15 17:24:39,NaN
25%,NaN,NaN,NaN,NaN,2.0,0.000000,NaN,2023-06-02 10:42:00.250000,NaN,2023-06-13 14:12:46,NaN
50%,NaN,NaN,NaN,NaN,2.0,0.000000,NaN,2024-02-02 15:35:03,NaN,2024-03-15 04:25:51,NaN
75%,NaN,NaN,NaN,NaN,2.0,0.000000,NaN,2025-01-08 13:43:06.500000,NaN,2025-02-08 10:33:34,NaN
max,NaN,NaN,NaN,NaN,2.0,11517.000000,NaN,2026-01-27 17:00:19,NaN,2026-01-27 18:27:11,NaN
std,NaN,NaN,NaN,NaN,0.0,106.956299,NaN,NaN,NaN,NaN,NaN

**Cek Validitas dan Kebersihan Data**

In [49]:
cek_nan(df_ulasan)

                      Jumlah Nilai Missing  Persentase Nilai Missing (%)
reviewCreatedVersion                 11811                        23.622
appVersion                           11811                        23.622
replyContent                         11031                        22.062
repliedAt                            11031                        22.062

In [50]:
visualize_row_with_duplicated(df_ulasan)

Tidak ada data duplikat

In [51]:
df = df_ulasan[['content', 'score']]

In [52]:
visualize_row_with_duplicated(df)

Jumlah Data Duplikat : 2221
Pasangan Data Duplikat :

         content  score
18125  *⁠\⁠0⁠/⁠*      2
32270  *⁠\⁠0⁠/⁠*      2

      content  score
25492  2 dulu      2
33919  2 dulu      2
39817  2 dulu      2
42511  2 dulu      2
46442  2 dulu      2

          content  score
28276  Agak lemot      2
29744  Agak lemot      2
36027  Agak lemot      2
47830  Agak lemot      2

                 content  score
7194  Alhamdulillah baik      2
8269  Alhamdulillah baik      2

      content  score
22506  Amanah      2
39125  Amanah      2

      content  score
28880    Aneh      2
32409    Aneh      2

         content  score
23882  Apa benar      2
24904  Apa benar      2

         content  score
18182  Apk bagus      2
36323  Apk bagus      2

         content  score
22464  Apk berat      2
25755  Apk berat      2

         content  score
18742  Apk lemot      2
45463  Apk lemot      2

             content  score
26288  Apk nya lemot      2
33956  Apk nya lemot      2
39297  Apk nya lemot      2
42532  Apk nya lemot      2

              content  score
15732  Aplikasi bagus      2
17296  Aplikasi bagus      2

                  content  score
17925  Aplikasi gak jelas      2
33634  Aplikasi gak jelas      2

                         content  score
8620   Aplikasi ini sangat bagus      2
29343  Aplikasi ini sangat bagus      2

              content  score
12007  Aplikasi jelek      2
21462  Aplikasi jelek      2
32719  Aplikasi jelek      2
36813  Aplikasi jelek      2
41353  Aplikasi jelek      2

              content  score
38530  Aplikasi lelet      2
47399  Aplikasi lelet      2

              content  score
11984  Aplikasi lemot      2
20551  Aplikasi lemot      2
26507  Aplikasi lemot      2
27937  Aplikasi lemot      2
28818  Aplikasi lemot      2
29658  Aplikasi lemot      2
29972  Aplikasi lemot      2
30131  Aplikasi lemot      2
32491  Aplikasi lemot      2
35133  Aplikasi lemot      2
36908  Aplikasi lemot      2
41195  Aplikasi lemot      2
42300  Aplikasi lemot      2
43240  Aplikasi lemot      2
43651  Aplikasi lemot      2
44975  Aplikasi lemot      2
45164  Aplikasi lemot      2
45521  Aplikasi lemot      2
46265  Aplikasi lemot      2
47710  Aplikasi lemot      2

                    content  score
11118  Aplikasi lemot parah      2
29428  Aplikasi lemot parah      2
42190  Aplikasi lemot parah      2

                  content  score
13647  Aplikasi nya berat      2
18749  Aplikasi nya berat      2
36571  Aplikasi nya berat      2

                  content  score
23024  Aplikasi nya lemot      2
32958  Aplikasi nya lemot      2
36332  Aplikasi nya lemot      2
43571  Aplikasi nya lemot      2
45547  Aplikasi nya lemot      2

                         content  score
24565  Aplikasi nya sangat bagus      2
43589  Aplikasi nya sangat bagus      2
44165  Aplikasi nya sangat bagus      2

                     content  score
23093  Aplikasi paling lemot      2
47232  Aplikasi paling lemot      2

                     content  score
19043  Aplikasi sangat lelet      2
48652  Aplikasi sangat lelet      2

                        content  score
11876  Aplikasi sangat membantu      2
37880  Aplikasi sangat membantu      2

                      content  score
28771  Aplikasi semakin lemot      2
48142  Aplikasi semakin lemot      2

                          content  score
45124  Aplikasi super duper lemot      2
45378  Aplikasi super duper lemot      2

                      content  score
37575  Aplikasi terlalu berat      2
40327  Aplikasi terlalu berat      2

                 content  score
12468  Aplikasinya bagus      2
35043  Aplikasinya bagus      2

                 content  score
21857  Aplikasinya berat      2
33639  Aplikasinya berat      2
34106  Aplikasinya berat      2
39528  Aplikasinya berat      2
42715  Aplikasinya berat      2

                 content  score
41916  Aplikasinya lelet      2
42654  Aplikasinya lelet      2

                 content  score
18076  Aplikasinya lemot      2
20800  Aplikasinya lemot      2
38336  Aplikasinya lemot      2
41659  Aplikasinya lemot      2
41915  Aplikasinya lemot      2
42220  Aplikasinya lemot      2
43384  Aplikasinya lemot      2

                        content  score
43847  Aplikasinya lemot banget      2
44159  Aplikasinya lemot banget      2

                        content  score
27809  Aplikasinya sangat lemot      2
36809  Aplikasinya sangat lemot      2

                         content  score
28451  Aplikasinya semakin lemot      2
36369  Aplikasinya semakin lemot      2

         content  score
29866  App berat      2
36956  App berat      2

      content  score
23003     Asu      2
23505     Asu      2
39494     Asu      2
41799     Asu      2

      content  score
11898    B aj      2
12176    B aj      2
13070    B aj      2
32606    B aj      2
35738    B aj      2

      content  score
22589   B aja      2
24558   B aja      2
30350   B aja      2
31705   B aja      2
32410   B aja      2
37516   B aja      2
38361   B aja      2
38874   B aja      2
42119   B aja      2
44091   B aja      2

      content  score
29638     Bad      2
33335     Bad      2
35116     Bad      2

      content  score
680     Bagus      2
1868    Bagus      2
2748    Bagus      2
3240    Bagus      2
5362    Bagus      2
...       ...    ...
47791   Bagus      2
47924   Bagus      2
48570   Bagus      2
49279   Bagus      2
49730   Bagus      2

[166 rows x 2 columns]

                  content  score
12208  Bagus aplikasi nya      2
23683  Bagus aplikasi nya      2
41065  Bagus aplikasi nya      2

            content  score
22831  Bagus banget      2
24745  Bagus banget      2
35485  Bagus banget      2
41448  Bagus banget      2

                content  score
101    Bagus banget sih      2
10729  Bagus banget sih      2

            content  score
9738   Bagus sekali      2
12709  Bagus sekali      2
20729  Bagus sekali      2
23887  Bagus sekali      2
30572  Bagus sekali      2
34781  Bagus sekali      2
35728  Bagus sekali      2
37324  Bagus sekali      2
38064  Bagus sekali      2

      content  score
15852  Baguss      2
17698  Baguss      2
35316  Baguss      2
38144  Baguss      2
39203  Baguss      2
41351  Baguss      2

        content  score
16724  Bagussss      2
38870  Bagussss      2

      content  score
17023   Bagys      2
32692   Bagys      2

      content  score
400      Baik      2
8896     Baik      2
12001    Baik      2
14435    Baik      2
14561    Baik      2
14820    Baik      2
15667    Baik      2
16004    Baik      2
16472    Baik      2
16606    Baik      2
17913    Baik      2
22131    Baik      2
22742    Baik      2
22884    Baik      2
23001    Baik      2
23389    Baik      2
24036    Baik      2
24532    Baik      2
24830    Baik      2
25223    Baik      2
28392    Baik      2
28628    Baik      2
30069    Baik      2
30230    Baik      2
31217    Baik      2
32297    Baik      2
32421    Baik      2
34545    Baik      2
34599    Baik      2
35427    Baik      2
36354    Baik      2
36569    Baik      2
37722    Baik      2
38131    Baik      2
38806    Baik      2
39132    Baik      2
39694    Baik      2
40027    Baik      2
40429    Baik      2
41249    Baik      2
41526    Baik      2
41832    Baik      2
45094    Baik      2
45786    Baik      2

      content  score
22414   Baik.      2
30937   Baik.      2

                     content  score
19467  Banyak biaya tambahan      2
41529  Banyak biaya tambahan      2

          content  score
12520  Banyak bug      2
18986  Banyak bug      2
19884  Banyak bug      2
25311  Banyak bug      2
33412  Banyak bug      2
37943  Banyak bug      2
38348  Banyak bug      2
48079  Banyak bug      2

            content  score
14429  Banyak iklan      2
15259  Banyak iklan      2
23081  Banyak iklan      2
23665  Banyak iklan      2
24031  Banyak iklan      2
24090  Banyak iklan      2
25080  Banyak iklan      2
30796  Banyak iklan      2
32595  Banyak iklan      2

                content  score
20887  Banyak iklan nya      2
25522  Banyak iklan nya      2

               content  score
14942  Banyak iklannya      2
36229  Banyak iklannya      2

          content  score
41753  Banyak lag      2
48175  Banyak lag      2

               content  score
19831  Banyak penipuan      2
26799  Banyak penipuan      2

                           content  score
12552  Banyak penjual barang palsu      2
39647  Banyak penjual barang palsu      2

                       content  score
14794  Barang barang nya mahal      2
38107  Barang barang nya mahal      2

         content  score
20716  Baru coba      2
28768  Baru coba      2

            content  score
34649  Baru mencoba      2
38683  Baru mencoba      2

      content  score
12908   Berat      2
31575   Berat      2

      content  score
27249    Best      2
47955    Best      2

      content  score
13101    Bgus      2
24176    Bgus      2
25496    Bgus      2
39722    Bgus      2
41275    Bgus      2

      content  score
28819   Bguss      2
30233   Bguss      2

      content  score
17554  Bgusss      2
41062  Bgusss      2

      content  score
12582   Biasa      2
45780   Biasa      2

         content  score
9124   Biasa aja      2
10867  Biasa aja      2
19077  Biasa aja      2
22200  Biasa aja      2
24234  Biasa aja      2
29164  Biasa aja      2
30761  Biasa aja      2
37354  Biasa aja      2
43832  Biasa aja      2

          content  score
19217  Biasa saja      2
39279  Biasa saja      2

                            content  score
31132  Biaya penanganan makin mahal      2
42560  Biaya penanganan makin mahal      2

      content  score
40415  Biyasa      2
46944  Biyasa      2

      content  score
14849      Bu      2
25424      Bu      2
37677      Bu      2
41976      Bu      2

      content  score
13308   Bu Bu      2
25176   Bu Bu      2

      content  score
11541   Buruk      2
12032   Buruk      2
14578   Buruk      2
17176   Buruk      2
19151   Buruk      2
23437   Buruk      2
30163   Buruk      2
34863   Buruk      2
35595   Buruk      2
47889   Buruk      2
48880   Buruk      2
49847   Buruk      2

      content  score
10602  Burukk      2
25520  Burukk      2

      content  score
26724   Butut      2
29593   Butut      2

      content  score
10825    Coba      2
30565    Coba      2

        content  score
21839  Coba dlu      2
24550  Coba dlu      2
31125  Coba dlu      2
40112  Coba dlu      2

         content  score
14668  Coba dulu      2
14885  Coba dulu      2
16732  Coba dulu      2
19188  Coba dulu      2
19598  Coba dulu      2
21881  Coba dulu      2
22482  Coba dulu      2
22823  Coba dulu      2
24783  Coba dulu      2
25617  Coba dulu      2
32881  Coba dulu      2
36781  Coba dulu      2
37859  Coba dulu      2
39293  Coba dulu      2
40301  Coba dulu      2
41601  Coba dulu      2
46360  Coba dulu      2

          content  score
15183  Cukup baik      2
25232  Cukup baik      2
44350  Cukup baik      2

      content  score
14021      Di      2
27211      Di      2
32372      Di      2

       content  score
21074  Di coba      2
29379  Di coba      2
34129  Di coba      2
35098  Di coba      2

            content  score
14703  Di coba dulu      2
43336  Di coba dulu      2

      content  score
26821  Dicoba      2
34494  Dicoba      2
42496  Dicoba      2

                 content  score
15170  Download nya lama      2
27118  Download nya lama      2

                content  score
24659  Dua bintang dulu      2
29986  Dua bintang dulu      2

        content  score
34532  Dua dulu      2
40914  Dua dulu      2

      content  score
28121    Enak      2
28693    Enak      2

      content  score
19049    Eror      2
20964    Eror      2
22436    Eror      2
29311    Eror      2
30732    Eror      2
48777    Eror      2

          content  score
19416  Eror terus      2
42688  Eror terus      2
48519  Eror terus      2

      content  score
48420   Error      2
49511   Error      2
49682   Error      2

          content  score
46829  Error mulu      2
49522  Error mulu      2

           content  score
18319  Error terus      2
31510  Error terus      2

                   content  score
27999  Gak bisa d download      2
32357  Gak bisa d download      2

              content  score
27450  Game nya bagus      2
35527  Game nya bagus      2

              content  score
21034  Gampang ngelag      2
39938  Gampang ngelag      2

      content  score
6528     Good      2
7487     Good      2
8573     Good      2
11149    Good      2
12473    Good      2
16980    Good      2
17422    Good      2
21538    Good      2
21632    Good      2
24288    Good      2
24775    Good      2
24833    Good      2
31724    Good      2
31806    Good      2
35303    Good      2
35625    Good      2
37273    Good      2
37379    Good      2
38038    Good      2
38593    Good      2
40192    Good      2
40220    Good      2
40808    Good      2
41578    Good      2
42218    Good      2
45372    Good      2
45537    Good      2
46616    Good      2

      content  score
33614   Goood      2
34769   Goood      2

      content  score
18643   Hadeh      2
34998   Hadeh      2

      content  score
32193  Hahaha      2
35281  Hahaha      2

      content  score
18366   Hapus      2
39793   Hapus      2

      content  score
24204     Huh      2
36406     Huh      2
37802     Huh      2

      content  score
12449   Iklan      2
26558   Iklan      2
30870   Iklan      2

            content  score
20493  Iklan ganggu      2
35399  Iklan ganggu      2

            content  score
19703  Iklan melulu      2
26055  Iklan melulu      2

                content  score
12004  Iklan mengganggu      2
12776  Iklan mengganggu      2
32559  Iklan mengganggu      2

                       content  score
17070  Iklan nya ganggu banget      2
19858  Iklan nya ganggu banget      2

                           content  score
12081  Iklan nya sangat mengganggu      2
22658  Iklan nya sangat mengganggu      2
24372  Iklan nya sangat mengganggu      2
33760  Iklan nya sangat mengganggu      2

                       content  score
24192  Iklan sangat mengganggu      2
32996  Iklan sangat mengganggu      2

                   content  score
19284  Iklannya mengganggu      2
32169  Iklannya mengganggu      2

                          content  score
30182  Iklannya sangat mengganggu      2
34936  Iklannya sangat mengganggu      2

      content  score
27851     Iya      2
39462     Iya      2
46762     Iya      2

          content  score
31386  Jadi lemot      2
38159  Jadi lemot      2
45392  Jadi lemot      2

                        content  score
47143  Jarang ada gratis ongkir      2
47649  Jarang ada gratis ongkir      2

      content  score
14175   Jelek      2
18006   Jelek      2
19279   Jelek      2
20494   Jelek      2
20901   Jelek      2
25406   Jelek      2
25524   Jelek      2
26477   Jelek      2
27192   Jelek      2
27787   Jelek      2
27865   Jelek      2
35343   Jelek      2
35623   Jelek      2
37206   Jelek      2
37897   Jelek      2
40470   Jelek      2
41942   Jelek      2
43226   Jelek      2
43939   Jelek      2

            content  score
13311  Jelek banget      2
16844  Jelek banget      2
18043  Jelek banget      2

      content  score
3757      Jos      2
10930     Jos      2
20100     Jos      2
22499     Jos      2
38205     Jos      2
43617     Jos      2

      content  score
24043   Kacau      2
45562   Kacau      2

            content  score
24081  Kasih 2 dulu      2
48935  Kasih 2 dulu      2

                content  score
16518  Kebanyakan iklan      2
23643  Kebanyakan iklan      2
26226  Kebanyakan iklan      2
42187  Kebanyakan iklan      2

                 content  score
12009  Kebanyakan update      2
30211  Kebanyakan update      2

      content  score
10763  Kecewa      2
19702  Kecewa      2
23396  Kecewa      2
23443  Kecewa      2
25463  Kecewa      2
43312  Kecewa      2
45600  Kecewa      2
48538  Kecewa      2

      content  score
12185   Keren      2
13904   Keren      2
20984   Keren      2
24502   Keren      2
35256   Keren      2
35852   Keren      2
36985   Keren      2
37152   Keren      2
37981   Keren      2
38000   Keren      2
38022   Keren      2
38279   Keren      2
38991   Keren      2
40074   Keren      2

            content  score
15761  Keren banget      2
22858  Keren banget      2

                  content  score
29131  Kok makin lemot ya      2
41688  Kok makin lemot ya      2

      content  score
14897  Kurang      2
20736  Kurang      2
29598  Kurang      2
31571  Kurang      2
38476  Kurang      2

            content  score
23471  Kurang bagus      2
24969  Kurang bagus      2
26941  Kurang bagus      2
29974  Kurang bagus      2
31923  Kurang bagus      2
32485  Kurang bagus      2
40454  Kurang bagus      2

           content  score
16893  Kurang baik      2
29179  Kurang baik      2
30731  Kurang baik      2

           content  score
14631  Kurang puas      2
43557  Kurang puas      2

                content  score
14972  Kurang responsif      2
26131  Kurang responsif      2

      content  score
26574   LEMOT      2
33025   LEMOT      2
37424   LEMOT      2
42373   LEMOT      2
42972   LEMOT      2
47641   LEMOT      2

      content  score
37301     Lag      2
41664     Lag      2
41791     Lag      2
41963     Lag      2
49083     Lag      2

         content  score
8682   Lag parah      2
16373  Lag parah      2
20810  Lag parah      2

           content  score
25606  Lama banget      2
44906  Lama banget      2

                        content  score
11696  Lama banget download nya      2
41272  Lama banget download nya      2

      content  score
24294  Lambat      2
24392  Lambat      2
27935  Lambat      2
32746  Lambat      2
33727  Lambat      2
33933  Lambat      2
35073  Lambat      2
35945  Lambat      2
35968  Lambat      2
36627  Lambat      2
40660  Lambat      2
41834  Lambat      2
48176  Lambat      2

             content  score
36868  Lambat banget      2
43948  Lambat banget      2

              content  score
33797  Lambat loading      2
41585  Lambat loading      2

                 content  score
10723  Lambat pengiriman      2
13144  Lambat pengiriman      2
40748  Lambat pengiriman      2

      content  score
17985   Lelet      2
18616   Lelet      2
26259   Lelet      2
28507   Lelet      2
31631   Lelet      2
31695   Lelet      2
32472   Lelet      2
34032   Lelet      2
34991   Lelet      2
36179   Lelet      2
36259   Lelet      2
36489   Lelet      2
36682   Lelet      2
36735   Lelet      2
36906   Lelet      2
36929   Lelet      2
37049   Lelet      2
37144   Lelet      2
37196   Lelet      2
37327   Lelet      2
37358   Lelet      2
38265   Lelet      2
38567   Lelet      2
40694   Lelet      2
41254   Lelet      2
42157   Lelet      2
43752   Lelet      2
43947   Lelet      2
43968   Lelet      2
44990   Lelet      2
46233   Lelet      2
46947   Lelet      2
47486   Lelet      2
47916   Lelet      2
48239   Lelet      2

            content  score
35102  Lelet banget      2
36301  Lelet banget      2
38938  Lelet banget      2
42998  Lelet banget      2

         content  score
18821  Lelet bgt      2
34965  Lelet bgt      2

           content  score
10275  Lelet lemot      2
29289  Lelet lemot      2

                        content  score
34749  Lelet sekali aplikasinya      2
36507  Lelet sekali aplikasinya      2

        content  score
15172  Lemoooot      2
37286  Lemoooot      2
45706  Lemoooot      2

       content  score
42914  Lemooot      2
43140  Lemooot      2

      content  score
33036  Lemoot      2
36872  Lemoot      2
38049  Lemoot      2
38295  Lemoot      2

       content  score
41623  Lemoott      2
46284  Lemoott      2

      content  score
12476   Lemot      2
12557   Lemot      2
14976   Lemot      2
16781   Lemot      2
17634   Lemot      2
...       ...    ...
46433   Lemot      2
46452   Lemot      2
46545   Lemot      2
46740   Lemot      2
47272   Lemot      2

[124 rows x 2 columns]

                 content  score
15995  Lemot aplikasinya      2
30362  Lemot aplikasinya      2
47642  Lemot aplikasinya      2

            content  score
8253   Lemot banget      2
11169  Lemot banget      2
13234  Lemot banget      2
23961  Lemot banget      2
27993  Lemot banget      2
29055  Lemot banget      2
29234  Lemot banget      2
30715  Lemot banget      2
32115  Lemot banget      2
36423  Lemot banget      2
36557  Lemot banget      2
37594  Lemot banget      2
41860  Lemot banget      2
42561  Lemot banget      2
42990  Lemot banget      2
45057  Lemot banget      2
45879  Lemot banget      2
46490  Lemot banget      2
46684  Lemot banget      2

              content  score
30968  Lemot banget .      2
32774  Lemot banget .      2

                        content  score
43717  Lemot banget aplikasinya      2
45069  Lemot banget aplikasinya      2

                content  score
43611  Lemot banget dah      2
45822  Lemot banget dah      2

         content  score
28273  Lemot bgt      2
29740  Lemot bgt      2
36643  Lemot bgt      2
36713  Lemot bgt      2
37250  Lemot bgt      2
42721  Lemot bgt      2
45624  Lemot bgt      2

                content  score
36170  Lemot bgt apknya      2
42212  Lemot bgt apknya      2

           content  score
23994  Lemot parah      2
31878  Lemot parah      2
37779  Lemot parah      2
39154  Lemot parah      2
41447  Lemot parah      2
42492  Lemot parah      2
42652  Lemot parah      2
45005  Lemot parah      2
47765  Lemot parah      2

            content  score
34847  Lemot sekali      2
43505  Lemot sekali      2
45728  Lemot sekali      2

              content  score
29272  Lemot sekarang      2
44006  Lemot sekarang      2

      content  score
33090  Lemot.      2
45328  Lemot.      2
49920  Lemot.      2

       content  score
45174  Lemot..      2
47358  Lemot..      2

          content  score
42636  Lemot.....      2
45265  Lemot.....      2

      content  score
33301  Lemott      2
36064  Lemott      2
36564  Lemott      2
42569  Lemott      2
43481  Lemott      2
43829  Lemott      2
44208  Lemott      2
48469  Lemott      2

       content  score
28091  Lemottt      2
36032  Lemottt      2
40269  Lemottt      2
42659  Lemottt      2
44229  Lemottt      2

        content  score
23808  Lemotttt      2
42452  Lemotttt      2

          content  score
36554  Lemotttttt      2
46176  Lemotttttt      2

       content  score
19210  Loading      2
27675  Loading      2
47134  Loading      2

          content  score
18547  Luar biasa      2
35363  Luar biasa      2
48102  Luar biasa      2

       content  score
4248   Lumayan      2
8343   Lumayan      2
10718  Lumayan      2
10964  Lumayan      2
11971  Lumayan      2
12946  Lumayan      2
14152  Lumayan      2
14193  Lumayan      2
15417  Lumayan      2
15469  Lumayan      2
16662  Lumayan      2
20340  Lumayan      2
21360  Lumayan      2
21624  Lumayan      2
24084  Lumayan      2
24843  Lumayan      2
27268  Lumayan      2
27463  Lumayan      2
27733  Lumayan      2
32391  Lumayan      2
33013  Lumayan      2
34349  Lumayan      2
35000  Lumayan      2
35317  Lumayan      2
36201  Lumayan      2
36592  Lumayan      2
37191  Lumayan      2
37514  Lumayan      2
39698  Lumayan      2
40519  Lumayan      2
41120  Lumayan      2
41717  Lumayan      2
43458  Lumayan      2
43850  Lumayan      2
46432  Lumayan      2

             content  score
15168  Lumayan bagus      2
22339  Lumayan bagus      2
28432  Lumayan bagus      2

             content  score
24729  Lumayan murah      2
32341  Lumayan murah      2

      content  score
13310   Lumyn      2
32250   Lumyn      2
40847   Lumyn      2

           content  score
22115  Makin berat      2
41483  Makin berat      2

                            content  score
28312  Makin diperbarui makin lemot      2
45858  Makin diperbarui makin lemot      2

           content  score
22343  Makin jelek      2
30434  Makin jelek      2
41836  Makin jelek      2

                         content  score
43407  Makin ke sini makin lemot      2
44995  Makin ke sini makin lemot      2

                        content  score
15522  Makin kesini makin berat      2
18207  Makin kesini makin berat      2

                        content  score
38314  Makin kesini makin lelet      2
46589  Makin kesini makin lelet      2

                        content  score
31679  Makin kesini makin lemot      2
31954  Makin kesini makin lemot      2
34547  Makin kesini makin lemot      2
43360  Makin kesini makin lemot      2
44812  Makin kesini makin lemot      2
46592  Makin kesini makin lemot      2

                      content  score
28292  Makin lama makin lemot      2
35784  Makin lama makin lemot      2
36531  Makin lama makin lemot      2
37790  Makin lama makin lemot      2
46753  Makin lama makin lemot      2

            content  score
43359  Makin lambat      2
47210  Makin lambat      2

           content  score
33788  Makin lelet      2
38250  Makin lelet      2
45831  Makin lelet      2

           content  score
14382  Makin lemot      2
14950  Makin lemot      2
27735  Makin lemot      2
28983  Makin lemot      2
30189  Makin lemot      2
42777  Makin lemot      2
45972  Makin lemot      2
47198  Makin lemot      2
47960  Makin lemot      2

                        content  score
28410  Makin lemot aplikasi nya      2
36710  Makin lemot aplikasi nya      2

      content  score
13923  Mantab      2
19929  Mantab      2
25725  Mantab      2
30428  Mantab      2

      content  score
28990  Mantaf      2
30987  Mantaf      2

      content  score
819    Mantap      2
1378   Mantap      2
4305   Mantap      2
10277  Mantap      2
11327  Mantap      2
...       ...    ...
45333  Mantap      2
45575  Mantap      2
47189  Mantap      2
47651  Mantap      2
49734  Mantap      2

[66 rows x 2 columns]

      content  score
6206   Mantep      2
39659  Mantep      2
41163  Mantep      2

             content  score
12117  Masih mencoba      2
25561  Masih mencoba      2

             content  score
22631  Mau coba dulu      2
37405  Mau coba dulu      2

        content  score
20535  Membantu      2
39693  Membantu      2
43857  Membantu      2

         content  score
16005  Memuaskan      2
23216  Memuaskan      2
25598  Memuaskan      2
28308  Memuaskan      2
40280  Memuaskan      2
42344  Memuaskan      2
48894  Memuaskan      2

       content  score
36262  Mencoba      2
40741  Mencoba      2
46322  Mencoba      2

            content  score
11378  Mengecewakan      2
19127  Mengecewakan      2
21776  Mengecewakan      2
28603  Mengecewakan      2

          content  score
13407  Mengganggu      2
39843  Mengganggu      2
40643  Mengganggu      2
46086  Mengganggu      2

         content  score
22965  Menggangu      2
29511  Menggangu      2

      content  score
15649   Mntap      2
33574   Mntap      2
36508   Mntap      2
37764   Mntap      2

      content  score
21374  Monyet      2
30599  Monyet      2

      content  score
42378  Ngebug      2
43930  Ngebug      2
47953  Ngebug      2

      content  score
13958  Ngelag      2
37770  Ngelag      2
40350  Ngelag      2

           content  score
18262  Ngelag mulu      2
43356  Ngelag mulu      2
45376  Ngelag mulu      2

            content  score
15374  Ngelag parah      2
43182  Ngelag parah      2
45595  Ngelag parah      2

      content  score
11906  Ngeleg      2
34315  Ngeleg      2

      content  score
22729    Nice      2
34227    Nice      2
35177    Nice      2
47005    Nice      2

         content  score
18255  No coment      2
35077  No coment      2

      content  score
16127      Oh      2
38240      Oh      2

      content  score
8164       Ok      2
8511       Ok      2
10621      Ok      2
11420      Ok      2
12644      Ok      2
...       ...    ...
46745      Ok      2
46953      Ok      2
47910      Ok      2
48045      Ok      2
48572      Ok      2

[95 rows x 2 columns]

      content  score
28404  Ok lah      2
35594  Ok lah      2

      content  score
6750      Oke      2
12551     Oke      2
20000     Oke      2
21715     Oke      2
25753     Oke      2
26100     Oke      2
28864     Oke      2
29707     Oke      2
29774     Oke      2
31087     Oke      2
31106     Oke      2
31811     Oke      2
34459     Oke      2
34695     Oke      2
36444     Oke      2
39438     Oke      2
39810     Oke      2
44816     Oke      2
46359     Oke      2

       content  score
11507  Oke deh      2
41681  Oke deh      2

      content  score
16585    Okee      2
32291    Okee      2
35955    Okee      2

            content  score
13535  Ongkir mahal      2
19628  Ongkir mahal      2
24472  Ongkir mahal      2
27494  Ongkir mahal      2
27719  Ongkir mahal      2

                  content  score
36198  Ongkir makin mahal      2
37433  Ongkir makin mahal      2

                    content  score
16338  Ongkir terlalu mahal      2
29218  Ongkir terlalu mahal      2

                   content  score
21064  Ongkirnya kemahalan      2
37674  Ongkirnya kemahalan      2

               content  score
19542  Ongkirnya mahal      2
40120  Ongkirnya mahal      2

              content  score
35872  Parah sekarang      2
45900  Parah sekarang      2

      content  score
21485   Payah      2
22871   Payah      2
39007   Payah      2

        content  score
25095  Pedagang      2
37464  Pedagang      2

                   content  score
41746  Pelit gratis ongkir      2
43604  Pelit gratis ongkir      2

       content  score
45557  Pelittt      2
47793  Pelittt      2

      content  score
12737  Pemula      2
25886  Pemula      2

               content  score
10819  Pengiriman lama      2
15120  Pengiriman lama      2
16470  Pengiriman lama      2
17038  Pengiriman lama      2
18565  Pengiriman lama      2
19570  Pengiriman lama      2
25661  Pengiriman lama      2
28679  Pengiriman lama      2
42162  Pengiriman lama      2
45217  Pengiriman lama      2

                 content  score
12420  Pengiriman lambat      2
13134  Pengiriman lambat      2
15161  Pengiriman lambat      2
17144  Pengiriman lambat      2
18517  Pengiriman lambat      2
21743  Pengiriman lambat      2
23456  Pengiriman lambat      2
23570  Pengiriman lambat      2
26987  Pengiriman lambat      2

                       content  score
693    Pengiriman sangat buruk      2
42828  Pengiriman sangat buruk      2

                       content  score
30869  Pengiriman terlalu lama      2
34119  Pengiriman terlalu lama      2

      content  score
16171    Puas      2
19892    Puas      2
24515    Puas      2
28555    Puas      2
43278    Puas      2

      content  score
23170   Ribet      2
34537   Ribet      2
34613   Ribet      2
39865   Ribet      2
45567   Ribet      2
47129   Ribet      2

            content  score
11189  Sangat bagus      2
14359  Sangat bagus      2
15823  Sangat bagus      2
19475  Sangat bagus      2
22328  Sangat bagus      2
22992  Sangat bagus      2
23393  Sangat bagus      2
25951  Sangat bagus      2
29715  Sangat bagus      2
30817  Sangat bagus      2
31712  Sangat bagus      2
34038  Sangat bagus      2
37089  Sangat bagus      2
40307  Sangat bagus      2
41020  Sangat bagus      2
42480  Sangat bagus      2

             content  score
20585  Sangat baguss      2
37590  Sangat baguss      2

           content  score
13117  Sangat baik      2
15350  Sangat baik      2
22818  Sangat baik      2
22951  Sangat baik      2
26538  Sangat baik      2
30864  Sangat baik      2
37078  Sangat baik      2
37365  Sangat baik      2
39093  Sangat baik      2
39397  Sangat baik      2
39823  Sangat baik      2
39914  Sangat baik      2
41569  Sangat baik      2
44286  Sangat baik      2
47844  Sangat baik      2

              content  score
11185  Sangat berguna      2
38605  Sangat berguna      2

            content  score
16063  Sangat buruk      2
17119  Sangat buruk      2

            content  score
14621  Sangat jelek      2
42719  Sangat jelek      2

             content  score
30610  Sangat lambat      2
34232  Sangat lambat      2
46064  Sangat lambat      2

            content  score
28777  Sangat lemot      2
42484  Sangat lemot      2

               content  score
22303  Sangat membantu      2
27122  Sangat membantu      2
27392  Sangat membantu      2
28966  Sangat membantu      2
41433  Sangat membantu      2
46828  Sangat membantu      2
48165  Sangat membantu      2

                      content  score
17320  Sangat membantu sekali      2
30500  Sangat membantu sekali      2

                content  score
12194  Sangat memuaskan      2
28965  Sangat memuaskan      2

           content  score
3410   Sangat puas      2
22706  Sangat puas      2
25516  Sangat puas      2
25644  Sangat puas      2
32263  Sangat puas      2
40332  Sangat puas      2

      content  score
15694    Saya      2
29943    Saya      2

              content  score
8176   Saya coba dulu      2
14133  Saya coba dulu      2
40091  Saya coba dulu      2
42301  Saya coba dulu      2

                content  score
8614   Saya sangat suka      2
33027  Saya sangat suka      2

           content  score
38130  Saya senang      2
39169  Saya senang      2

       content  score
22292  Sedikit      2
25945  Sedikit      2

                     content  score
28207  Sekarang lemot banget      2
42735  Sekarang lemot banget      2

                   content  score
23067  Selalu minta update      2
29995  Selalu minta update      2

             content  score
28964  Semakin buruk      2
47531  Semakin buruk      2

             content  score
21985  Semakin lemot      2
28342  Semakin lemot      2
38198  Semakin lemot      2
42837  Semakin lemot      2

      content  score
19592  Senang      2
22298  Senang      2
25736  Senang      2
39733  Senang      2

          content  score
47918  Sering bug      2
49689  Sering bug      2

           content  score
30681  Sering eror      2
30750  Sering eror      2
36754  Sering eror      2
37418  Sering eror      2
38010  Sering eror      2
43098  Sering eror      2
48585  Sering eror      2

            content  score
28366  Sering error      2
30268  Sering error      2
31426  Sering error      2
35734  Sering error      2
38513  Sering error      2
45657  Sering error      2
46463  Sering error      2
48037  Sering error      2

                     content  score
22005  Sering keluar sendiri      2
29195  Sering keluar sendiri      2
43624  Sering keluar sendiri      2

          content  score
19334  Sering lag      2
41821  Sering lag      2

            content  score
8703   Sering lemot      2
35544  Sering lemot      2
38179  Sering lemot      2
38475  Sering lemot      2

             content  score
43212  Sering ngelag      2
43601  Sering ngelag      2

      content  score
11542    Seru      2
23097    Seru      2
34961    Seru      2

      content  score
25752  Shopee      2
49707  Shopee      2

             content  score
1390   Shopee mantap      2
29440  Shopee mantap      2
33602  Shopee mantap      2

                            content  score
10544  Shopee sekarang lemot banget      2
32603  Shopee sekarang lemot banget      2

      content  score
35335    Siip      2
36975    Siip      2
39980    Siip      2

          content  score
25429  Spam iklan      2
43204  Spam iklan      2

      content  score
23101    Suka      2
33294    Suka      2
40103    Suka      2
42155    Suka      2
44818    Suka      2
45840    Suka      2

         content  score
26513  Suka eror      2
34410  Suka eror      2
37574  Suka eror      2

           content  score
21623  Suka ngelag      2
44766  Suka ngelag      2

           content  score
18031  Super lelet      2
34234  Super lelet      2
38427  Super lelet      2
38496  Super lelet      2

           content  score
41158  Super lemot      2
43991  Super lemot      2
45480  Super lemot      2

      content  score
22458   Susah      2
48799   Susah      2

               content  score
38226  Susah di update      2
48902  Susah di update      2

            content  score
32091  Susah log in      2
41744  Susah log in      2

           content  score
16072  Susah login      2
43459  Susah login      2

            content  score
14407  Tambah lemot      2
34884  Tambah lemot      2
43390  Tambah lemot      2

       content  score
25648  Terbaik      2
29354  Terbaik      2
38675  Terbaik      2

            content  score
3297   Terima kasih      2
6718   Terima kasih      2
29869  Terima kasih      2
34778  Terima kasih      2

           content  score
39660  Terimakasih      2
42954  Terimakasih      2

                    content  score
18144  Terlalu banyak iklan      2
23259  Terlalu banyak iklan      2
23297  Terlalu banyak iklan      2
23319  Terlalu banyak iklan      2
24675  Terlalu banyak iklan      2
27043  Terlalu banyak iklan      2
27882  Terlalu banyak iklan      2
28496  Terlalu banyak iklan      2
31177  Terlalu banyak iklan      2
31870  Terlalu banyak iklan      2
32869  Terlalu banyak iklan      2
33309  Terlalu banyak iklan      2
36435  Terlalu banyak iklan      2
39197  Terlalu banyak iklan      2
40617  Terlalu banyak iklan      2

             content  score
36340  Terlalu lemot      2
37247  Terlalu lemot      2
38170  Terlalu lemot      2
39322  Terlalu lemot      2

                     content  score
17339  Terlalu sering update      2
43620  Terlalu sering update      2

           content  score
25426  Tidak bagus      2
35290  Tidak bagus      2

              content  score
15074  Tidak bisa cod      2
15347  Tidak bisa cod      2
28133  Tidak bisa cod      2

                      content  score
23469  Tidak bisa di download      2
28841  Tidak bisa di download      2

                    content  score
25171  Tidak bisa di update      2
31891  Tidak bisa di update      2

      content  score
19757   Tolol      2
48820   Tolol      2

      content  score
27104     Top      2
43400     Top      2

                content  score
19104  Trlalu byk iklan      2
22760  Trlalu byk iklan      2

        content  score
48031  Uji coba      2
48282  Uji coba      2

           content  score
17379  Update mulu      2
19343  Update mulu      2
27435  Update mulu      2
32119  Update mulu      2

      content  score
13052      Wa      2
18356      Wa      2
21042      Wa      2
31716      Wa      2
33434      Wa      2

      content  score
27258      We      2
27930      We      2

      content  score
26811     Wow      2
30256     Wow      2

          content  score
8390   agak lemot      2
45370  agak lemot      2

              content  score
33083  aplikasi lemot      2
33145  aplikasi lemot      2
35086  aplikasi lemot      2
38319  aplikasi lemot      2
39637  aplikasi lemot      2
39710  aplikasi lemot      2

                      content  score
3734   aplikasi terlalu berat      2
35780  aplikasi terlalu berat      2

                        content  score
9585   aplikasinya berat banget      2
31000  aplikasinya berat banget      2

      content  score
34353    b aj      2
47933    b aj      2

      content  score
3884    b aja      2
10082   b aja      2
14886   b aja      2
16559   b aja      2
29214   b aja      2
38612   b aja      2

      content  score
55      bagus      2
154     bagus      2
158     bagus      2
222     bagus      2
419     bagus      2
...       ...    ...
37978   bagus      2
38016   bagus      2
38558   bagus      2
38679   bagus      2
39967   bagus      2

[152 rows x 2 columns]

            content  score
7786   bagus banget      2
9113   bagus banget      2
13380  bagus banget      2
17498  bagus banget      2
17683  bagus banget      2
19100  bagus banget      2
40472  bagus banget      2
40762  bagus banget      2

              content  score
5454   bagus dan aman      2
26881  bagus dan aman      2

            content  score
3881   bagus sekali      2
12519  bagus sekali      2
16303  bagus sekali      2
17595  bagus sekali      2
18252  bagus sekali      2
36167  bagus sekali      2

     content  score
2647  bagus.      2
3189  bagus.      2

      content  score
3428   baguss      2
5107   baguss      2
8155   baguss      2
13857  baguss      2
22360  baguss      2
23163  baguss      2
31597  baguss      2
35534  baguss      2

       content  score
30059  bagusss      2
37796  bagusss      2

      content  score
560      baik      2
1067     baik      2
1200     baik      2
1275     baik      2
1656     baik      2
...       ...    ...
34419    baik      2
35028    baik      2
35961    baik      2
36342    baik      2
38291    baik      2

[84 rows x 2 columns]

      content  score
3511    baikk      2
3657    baikk      2
12691   baikk      2
17376   baikk      2
18007   baikk      2

          content  score
1001   banyak bug      2
7108   banyak bug      2
10051  banyak bug      2
19074  banyak bug      2
32082  banyak bug      2

           content  score
143   banyak iklan      2
939   banyak iklan      2
6010  banyak iklan      2

               content  score
7160   banyak penipuan      2
9011   banyak penipuan      2
26725  banyak penipuan      2

      content  score
228      bgus      2
1967     bgus      2
2942     bgus      2
5601     bgus      2
6732     bgus      2
8714     bgus      2
11796    bgus      2
15053    bgus      2
16997    bgus      2
19219    bgus      2
23757    bgus      2
24643    bgus      2
32316    bgus      2
34110    bgus      2
36784    bgus      2
37100    bgus      2

         content  score
9068   biasa aja      2
9747   biasa aja      2
11226  biasa aja      2

          content  score
8858   biasa aja.      2
38633  biasa aja.      2

                        content  score
2259  biaya layanan makin mahal      2
8382  biaya layanan makin mahal      2

                 content  score
28838  bintang 2 aja dlu      2
35832  bintang 2 aja dlu      2

      content  score
12715   boleh      2
25342   boleh      2

      content  score
411     buruk      2
7830    buruk      2
9713    buruk      2
12287   buruk      2
21603   buruk      2
45532   buruk      2

         content  score
13000  coba dulu      2
16025  coba dulu      2
18498  coba dulu      2
32532  coba dulu      2
37211  coba dulu      2

      content  score
4711    cukup      2
4759    cukup      2
23395   cukup      2
23692   cukup      2

           content  score
6130   cukup bagus      2
21720  cukup bagus      2
24889  cukup bagus      2
42544  cukup bagus      2

          content  score
3828   cukup baik      2
24388  cukup baik      2
32443  cukup baik      2
36041  cukup baik      2

                 content  score
31010  gak bisa checkout      2
40777  gak bisa checkout      2

      content  score
2635     good      2
3295     good      2
3785     good      2
4217     good      2
4273     good      2
5547     good      2
7604     good      2
17055    good      2
17244    good      2
17420    good      2
17563    good      2
17930    good      2
22402    good      2
24207    good      2
29260    good      2
31149    good      2
33239    good      2
33450    good      2
33852    good      2
34061    good      2
35273    good      2
35928    good      2
35946    good      2
36082    good      2
36139    good      2
37713    good      2
44626    good      2

        content  score
8056   good job      2
24623  good job      2
35201  good job      2

      content  score
9940    hebat      2
24692   hebat      2
24738   hebat      2
25815   hebat      2
36073   hebat      2

               content  score
552    iklan lo ganggu      2
32349  iklan lo ganggu      2

      content  score
14605     iya      2
18865     iya      2

      content  score
1688    jelek      2
3627    jelek      2
5663    jelek      2
8410    jelek      2
8805    jelek      2
28846   jelek      2
31535   jelek      2
47153   jelek      2

      content  score
7709      jos      2
34514     jos      2
39699     jos      2

               content  score
6284   kasih bintang 2      2
25542  kasih bintang 2      2

              content  score
462    kasih dua dulu      2
47546  kasih dua dulu      2

                content  score
1941   kebanyakan iklan      2
2197   kebanyakan iklan      2
6396   kebanyakan iklan      2
6782   kebanyakan iklan      2
24506  kebanyakan iklan      2
28532  kebanyakan iklan      2

                 content  score
24345  kebanyakan update      2
39828  kebanyakan update      2

      content  score
5636     kece      2
33447    kece      2

                 content  score
497  kenapa gak bisa cod      2
588  kenapa gak bisa cod      2

      content  score
203     keren      2
1015    keren      2
7692    keren      2
9234    keren      2
9722    keren      2
11306   keren      2
12998   keren      2
14281   keren      2
16488   keren      2
17247   keren      2
18081   keren      2
20103   keren      2
24859   keren      2
27633   keren      2
29426   keren      2
34413   keren      2
35607   keren      2
36357   keren      2
36434   keren      2
38417   keren      2

      content  score
36518   kocak      2
41085   kocak      2

      content  score
1614     kren      2
36059    kren      2

      content  score
4362   kurang      2
7514   kurang      2
8225   kurang      2
45564  kurang      2

                content  score
4815   kurang memuaskan      2
6027   kurang memuaskan      2
9728   kurang memuaskan      2
37876  kurang memuaskan      2

          content  score
3545  kurang puas      2
3732  kurang puas      2

      content  score
27750     lag      2
34152     lag      2

         content  score
5809   lag parah      2
35272  lag parah      2
38891  lag parah      2

     content  score
3484  lamaaa      2
7443  lamaaa      2

      content  score
2531   lambat      2
6165   lambat      2
7470   lambat      2
7690   lambat      2
8077   lambat      2
33030  lambat      2

      content  score
81      lelet      2
3174    lelet      2
3418    lelet      2
4000    lelet      2
7035    lelet      2
8035    lelet      2
8812    lelet      2
12040   lelet      2
32208   lelet      2
35843   lelet      2
40529   lelet      2
47800   lelet      2

           content  score
40825  lelet parah      2
47564  lelet parah      2

      content  score
126     lemot      2
173     lemot      2
2423    lemot      2
3202    lemot      2
3275    lemot      2
3702    lemot      2
3989    lemot      2
4064    lemot      2
5598    lemot      2
5860    lemot      2
6081    lemot      2
9140    lemot      2
9654    lemot      2
9805    lemot      2
10030   lemot      2
12966   lemot      2
13118   lemot      2
15945   lemot      2
16579   lemot      2
17075   lemot      2
17852   lemot      2
18542   lemot      2
19035   lemot      2
19306   lemot      2
20456   lemot      2
22909   lemot      2
23507   lemot      2
23651   lemot      2
26822   lemot      2
31241   lemot      2
31584   lemot      2
31686   lemot      2
31726   lemot      2
32376   lemot      2
32845   lemot      2
32981   lemot      2
33943   lemot      2
35542   lemot      2
35630   lemot      2
36029   lemot      2
36087   lemot      2
36370   lemot      2
36820   lemot      2
36876   lemot      2
37985   lemot      2
38353   lemot      2
38458   lemot      2
39405   lemot      2
40518   lemot      2
41295   lemot      2
45097   lemot      2
47734   lemot      2

         content  score
9981   lemot bgt      2
35518  lemot bgt      2
37725  lemot bgt      2
39090  lemot bgt      2
39304  lemot bgt      2
47716  lemot bgt      2

           content  score
12366  lemot parah      2
39911  lemot parah      2

      content  score
42216  lemot.      2
42458  lemot.      2

      content  score
16741  lemott      2
29036  lemott      2
43673  lemott      2

       content  score
6922   lemottt      2
19507  lemottt      2
35849  lemottt      2
40901  lemottt      2

        content  score
28709  lemotttt      2
31699  lemotttt      2

               content  score
35283  loadingnya lama      2
43435  loadingnya lama      2

          content  score
9288   luar biasa      2
33046  luar biasa      2

       content  score
3160   lumayan      2
3902   lumayan      2
4299   lumayan      2
4586   lumayan      2
5237   lumayan      2
5787   lumayan      2
6757   lumayan      2
7662   lumayan      2
9061   lumayan      2
9128   lumayan      2
10849  lumayan      2
12343  lumayan      2
15723  lumayan      2
24250  lumayan      2
24338  lumayan      2
24759  lumayan      2
30611  lumayan      2
32277  lumayan      2
33958  lumayan      2
38550  lumayan      2
39573  lumayan      2
42491  lumayan      2

             content  score
8586   lumayan bagus      2
27251  lumayan bagus      2
39073  lumayan bagus      2

           content  score
8069   lumayan lah      2
12639  lumayan lah      2

           content  score
24066  makin lemot      2
37222  makin lemot      2
45580  makin lemot      2
47356  makin lemot      2

      content  score
6221   mantab      2
7085   mantab      2
8234   mantab      2
9089   mantab      2
9584   mantab      2
24164  mantab      2
31680  mantab      2
39691  mantab      2

      content  score
1211   mantap      2
1765   mantap      2
1924   mantap      2
2572   mantap      2
3197   mantap      2
...       ...    ...
38631  mantap      2
38670  mantap      2
39641  mantap      2
39692  mantap      2
46925  mantap      2

[81 rows x 2 columns]

       content  score
7424   mantap👍      2
19412  mantap👍      2

      content  score
3648   mantep      2
18977  mantep      2

      content  score
5494   mantul      2
7822   mantul      2
11063  mantul      2

      content  score
6078    mayan      2
10253   mayan      2
20592   mayan      2

        content  score
8229  memuaskan      2
9029  memuaskan      2

       content  score
4446   menarik      2
7259   menarik      2
10148  menarik      2
11782  menarik      2
30960  menarik      2
37560  menarik      2

            content  score
541    menyenangkan      2
32507  menyenangkan      2

      content  score
10438   mntap      2
18543   mntap      2
31895   mntap      2
37798   mntap      2

      content  score
13244   mudah      2
26279   mudah      2

      content  score
7426    murah      2
34517   murah      2

       content  score
4528   nge bug      2
31941  nge bug      2

      content  score
7411   ngelag      2
8033   ngelag      2
9203   ngelag      2
35863  ngelag      2

            content  score
8801   ngelag parah      2
21504  ngelag parah      2
30641  ngelag parah      2

      content  score
12171    nice      2
20397    nice      2
37458    nice      2

      content  score
570        ok      2
831        ok      2
1205       ok      2
1932       ok      2
2397       ok      2
...       ...    ...
37195      ok      2
38541      ok      2
39084      ok      2
39775      ok      2
42274      ok      2

[67 rows x 2 columns]

      content  score
170       oke      2
390       oke      2
4367      oke      2
6468      oke      2
9644      oke      2
10999     oke      2
11339     oke      2
11820     oke      2
15984     oke      2
17020     oke      2
19523     oke      2
19914     oke      2
19917     oke      2
20928     oke      2
23104     oke      2
24488     oke      2
25959     oke      2
33640     oke      2
34047     oke      2
34258     oke      2
34812     oke      2
35549     oke      2
35590     oke      2

            content  score
429    ongkir mahal      2
4530   ongkir mahal      2
19532  ongkir mahal      2

                        content  score
977    ongkir nya terlalu mahal      2
12354  ongkir nya terlalu mahal      2
26825  ongkir nya terlalu mahal      2

         content  score
3626  pada mahal      2
8299  pada mahal      2

              content  score
10132  pelayanan lama      2
16854  pelayanan lama      2

      content  score
3458   pemula      2
37834  pemula      2

                content  score
9902   pengiriman cepat      2
10857  pengiriman cepat      2

               content  score
1920   pengiriman lama      2
2326   pengiriman lama      2
2437   pengiriman lama      2
2943   pengiriman lama      2
2954   pengiriman lama      2
3689   pengiriman lama      2
5488   pengiriman lama      2
5976   pengiriman lama      2
6276   pengiriman lama      2
6438   pengiriman lama      2
7012   pengiriman lama      2
7143   pengiriman lama      2
7572   pengiriman lama      2
7654   pengiriman lama      2
7953   pengiriman lama      2
9000   pengiriman lama      2
9269   pengiriman lama      2
9630   pengiriman lama      2
10267  pengiriman lama      2
12424  pengiriman lama      2
15653  pengiriman lama      2
16650  pengiriman lama      2

                     content  score
2760  pengiriman lama banget      2
8929  pengiriman lama banget      2

                content  score
211   pengiriman lambat      2
897   pengiriman lambat      2
1162  pengiriman lambat      2
1519  pengiriman lambat      2
1780  pengiriman lambat      2
2735  pengiriman lambat      2
3852  pengiriman lambat      2
5503  pengiriman lambat      2
9359  pengiriman lambat      2
9520  pengiriman lambat      2

                       content  score
2244  pengiriman sangat lambat      2
6234  pengiriman sangat lambat      2

                              content  score
825   pengiriman sekarang super lelet      2
6279  pengiriman sekarang super lelet      2

      content  score
3687     puas      2
4710     puas      2
7718     puas      2
7799     puas      2
9087     puas      2
16319    puas      2
22806    puas      2
30185    puas      2
38713    puas      2

      content  score
1908    ribet      2
6260    ribet      2
33633   ribet      2

            content  score
370    sangat bagus      2
2058   sangat bagus      2
2921   sangat bagus      2
3731   sangat bagus      2
3960   sangat bagus      2
4992   sangat bagus      2
5227   sangat bagus      2
5373   sangat bagus      2
5576   sangat bagus      2
6048   sangat bagus      2
6405   sangat bagus      2
6504   sangat bagus      2
6884   sangat bagus      2
7759   sangat bagus      2
7842   sangat bagus      2
8450   sangat bagus      2
9104   sangat bagus      2
12989  sangat bagus      2
15394  sangat bagus      2
18240  sangat bagus      2
18526  sangat bagus      2
19242  sangat bagus      2
20959  sangat bagus      2
25479  sangat bagus      2
25906  sangat bagus      2
29591  sangat bagus      2
30444  sangat bagus      2
34539  sangat bagus      2
34729  sangat bagus      2
36700  sangat bagus      2

           content  score
1550   sangat baik      2
3216   sangat baik      2
6770   sangat baik      2
7308   sangat baik      2
9432   sangat baik      2
10145  sangat baik      2
12927  sangat baik      2
20688  sangat baik      2
22945  sangat baik      2
27593  sangat baik      2
34277  sangat baik      2
35421  sangat baik      2

                 content  score
25     sangat bermanfaat      2
28804  sangat bermanfaat      2
30623  sangat bermanfaat      2
37782  sangat bermanfaat      2

            content  score
2843   sangat cocok      2
36409  sangat cocok      2

            content  score
8562   sangat jelek      2
29111  sangat jelek      2

            content  score
22551  sangat keren      2
34242  sangat keren      2

               content  score
1597   sangat membantu      2
2188   sangat membantu      2
5760   sangat membantu      2
9197   sangat membantu      2
18474  sangat membantu      2
23045  sangat membantu      2
24496  sangat membantu      2

                content  score
3784   sangat memuaskan      2
5658   sangat memuaskan      2
10110  sangat memuaskan      2
13841  sangat memuaskan      2
35400  sangat memuaskan      2

              content  score
538    sangat menarik      2
1348   sangat menarik      2
8057   sangat menarik      2
10820  sangat menarik      2

           content  score
1069   sangat puas      2
3765   sangat puas      2
6959   sangat puas      2
8587   sangat puas      2
10089  sangat puas      2
18629  sangat puas      2
19243  sangat puas      2
26268  sangat puas      2
35372  sangat puas      2

         content  score
10212  saya suka      2
32622  saya suka      2

                                 content  score
2426  sekarang pengirimannya lama banget      2
3407  sekarang pengirimannya lama banget      2

        content  score
10447  semangat      2
37531  semangat      2

     content  score
1066  senang      2
7615  senang      2

             content  score
32619  seneng banget      2
36451  seneng banget      2

           content  score
27687  sering eror      2
27766  sering eror      2
43884  sering eror      2

               content  score
852   sering terlambat      2
3561  sering terlambat      2

      content  score
9804     seru      2
28536    seru      2

           content  score
4396   sngat bagus      2
26638  sngat bagus      2

      content  score
3483     suka      2
12031    suka      2
36589    suka      2
38446    suka      2

        content  score
6636  suka eror      2
7371  suka eror      2

      content  score
24948   super      2
36402   super      2

       content  score
13461  terbaik      2
14046  terbaik      2
15614  terbaik      2
23848  terbaik      2
32565  terbaik      2

            content  score
3383   terima kasih      2
12777  terima kasih      2

           content  score
23468  terimakasih      2
35546  terimakasih      2
38545  terimakasih      2

                    content  score
5203   terlalu banyak iklan      2
7345   terlalu banyak iklan      2
14613  terlalu banyak iklan      2
15948  terlalu banyak iklan      2
24264  terlalu banyak iklan      2
25855  terlalu banyak iklan      2

             content  score
2056  tidak bisa COD      2
3358  tidak bisa COD      2
6072  tidak bisa COD      2

             content  score
615   tidak bisa cod      2
7998  tidak bisa cod      2
8204  tidak bisa cod      2
8314  tidak bisa cod      2

      content  score
9831    tolol      2
13837   tolol      2

      content  score
32007     top      2
36398     top      2

      content  score
1685      👌👌👌      2
24209     👌👌👌      2

      content  score
2054        👍      2
3474        👍      2
5790        👍      2
6354        👍      2
9891        👍      2
15796       👍      2
17043       👍      2
17932       👍      2
21609       👍      2
22478       👍      2
24002       👍      2
24648       👍      2
27366       👍      2
32210       👍      2
33601       👍      2
37471       👍      2
38520       👍      2
38618       👍      2
39728       👍      2
40021       👍      2
40893       👍      2
41082       👍      2
41813       👍      2
45618       👍      2

      content  score
14983      👍👍      2
40386      👍👍      2
42189      👍👍      2

      content  score
3254      👍👍👍      2
6987      👍👍👍      2
15293     👍👍👍      2
25177     👍👍👍      2
32188     👍👍👍      2
34507     👍👍👍      2

      content  score
30283   👍👍👍👍👍      2
47555   👍👍👍👍👍      2

      content  score
14475       👎      2
27507       👎      2
34231       👎      2
38873       👎      2
46115       👎      2

      content  score
26768       🗿      2
31282       🗿      2
33953       🗿      2

      content  score
17850       😁      2
27073       😁      2
33378       😁      2
36696       😁      2

      content  score
17735       😃      2
24758       😃      2
38297       😃      2

      content  score
11714       😈      2
35422       😈      2

      content  score
31228       😍      2
37755       😍      2

      content  score
25911       😭      2
30396       😭      2

      content  score
6536        🙂      2
42306       🙂      2

      content  score
17369       🙏      2
24977       🙏      2

In [53]:
df.drop_duplicates(inplace=True)

In [54]:
visualize_row_with_duplicated(df)

Tidak ada data duplikat

In [55]:
print(f"Ukuran Data Setelah Pembersihan NaN dan Duplicated: {df.shape}")

Ukuran Data Setelah Pembersihan NaN dan Duplicated: (47779, 2)

**Labeling Data**

In [56]:
print("Labeling data berdasarkan skor bintang")
df_labeled = labeling_data(df)

Labeling data berdasarkan skor bintang

In [57]:
df_labeled.head(5)

                                             content  score    label
0  kesel banget sering masuk tiba tiba ke shoope ...      2  Negatif
1  kenapa pesanan. cod tidak bisa padahal sudah 2...      2  Negatif
2                     Ini kenpa ya gk bisa di instal      2  Negatif
3  titik pengantaran suka berubah sendiri malah b...      2  Negatif
4  TOLONG! kalau aku lagi baca Wattpad tuh jangan...      2  Negatif

**Pemeriksaan Distribusi Data, memastikan apakah terdapat imbalance atau tidak**

In [58]:
print("Distribusi Data per Kelas:")
print(df_labeled['label'].value_counts())

Distribusi Data per Kelas:
label
Negatif    47779
Name: count, dtype: int64

**Konversi ke csv untuk mempermudah dalam pembersihan data lebih lanjut**

In [ ]:
nama_file = 'dataset_ulasan_playstore.csv'
df_labeled.to_csv(nama_file, index=False)

print(f"Selesai! Data berhasil disimpan ke '{nama_file}'")
print(f"Total data: {len(df_labeled)}")

Selesai! Data berhasil disimpan ke 'dataset_ulasan_playstore_negatif.csv'
Total data: 47779